# TASK 2

Perform data cleaning and exploratory data analysis (EDA) on a dataset of your choice, such as the Titanic dataset from Kaggle. Explore the relationships between variables and identify patterns and trends in the data

In [1]:
## About the DataSet

We are using the Titanic Dataset here. It contains both numerical and string values

The predefined columns are -
Passenger ID - To identify unique passengers

Survived - If they survived or not

P Class - The class passengers travelled in

pclass: A proxy for socio-economic status (SES) 1st = Upper 2nd = Middle 3rd = Lower

Name - Passenger Name

Sex - Gender of Passenger

Age - Age of passenger

Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

SibSp - Number of siblings or spouse

Parch - Parent or child

Ticket - Ticket number

Fare - Amount paid for the ticket

Cabin - Cabin of residence

Embarked - Point of embarkmen

Importing the necessary libraries

In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
plt.style.use("seaborn-whitegrid")

C:\Users\anshi\AppData\Local\Temp\ipykernel_13660\289079118.py:4: MatplotlibDeprecationWarning: The seaborn styles shipped by Matplotlib are deprecated since 3.6, as they no longer correspond to the styles shipped by seaborn. However, they will remain available as 'seaborn-v0_8-<style>'. Alternatively, directly use the seaborn API instead.
  plt.style.use("seaborn-whitegrid")

Reading the dataset

In [3]:
data=pd.read_csv(r"C:\Users\anshi\Downloads\titanic\train.csv")

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

Shape of the dataframe

In [6]:
data.shape

(891, 12)

Information about the dataframe

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
Checking Missing Values

SyntaxError: invalid syntax (1187846522.py, line 1)

In [ ]:
data.isnull().sum()

Dealing with missing values

In [ ]:
perc_missing=data.isnull().sum()*100/len(data)
perc_missing

In [ ]:
data.drop('Cabin',axis=1,inplace=True)

In [ ]:
data.isnull().sum()

In [ ]:
data['Embarked'].mode()

In [ ]:
data['Embarked'] = data['Embarked'].fillna('S')

In [ ]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [ ]:
data.isnull().sum()

In [ ]:
import seaborn as sns
sns.heatmap(data.isna());

# UNIVARIATE ANALYSIS

In [ ]:
def bar_plot(variable):
    """
        input: variable ex: "Sex"
        output: bar plot & value count
    
    """
    
    var = data[variable]
    varValue = var.value_counts()
    plt.figure(figsize=(9,3))
    plt.bar(varValue.index, varValue)
    plt.xticks(varValue.index, varValue.index.values)
    plt.ylabel("Frequency")
    plt.title(variable)
    plt.show()
    print("{}: \n {}".format(variable,varValue))

In [ ]:
#categorical variables
category1 = ["Survived","Sex","Pclass","Embarked","SibSp","Parch"]
for c in category1:
    bar_plot(c)

# Bivariate Analysis

In [ ]:
def plot_hist(variable):
    plt.figure(figsize=(9,3))
    plt.hist(data[variable])
    plt.xlabel(variable)
    plt.ylabel("Frequency")
    plt.title("{} distribution with hist".format(variable))
    plt.show()
    
numericVar = ["Fare","Age","PassengerId"]
for c in numericVar:
    plot_hist(c)

In [ ]:
# Pclass - Survived
data[["Pclass","Survived"]].groupby(["Pclass"], as_index = False).mean().sort_values(by="Survived", ascending=False)

In [ ]:
# Sex - Survived
data[["Sex","Survived"]].groupby(["Sex"], as_index = False).mean().sort_values(by="Survived", ascending=False)

In [ ]:
# SibSp - Survived
data[["SibSp","Survived"]].groupby(["SibSp"], as_index = False).mean().sort_values(by="Survived", ascending=False)

In [ ]:
# Parch - Survived
data[["Parch","Survived"]].groupby(["Parch"], as_index = False).mean().sort_values(by="Survived", ascending=False)

In [ ]:
from scipy import stats

def detect_outliers_zscore(df, column):
    z_scores = stats.zscore(df[column].dropna())
    abs_z_scores = abs(z_scores)
    outliers = df[abs_z_scores > 3]
    return outliers

# Example for 'Fare' column
outliers_zscore = detect_outliers_zscore(data, 'Age')
print(outliers_zscore)

Detecting Outliers

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt

plt.figure(figsize=(10, 6))
sns.boxplot(x=data['Age'])
plt.title('Box Plot of Age')
plt.show()